##Bem-Vindo jupyter Notebook ao ambiente VS Code

In [27]:
print("Hello World {os classicos nunca morre!!}")

Hello World {os classicos nunca morre!!}

In [28]:
## Importação das bibliotecas
import pandas as pd ##Para a manipulação de DataFrames
import numpy as np ## Cálculo algébricos
import matplotlib.pyplot as plt ##Visualização dos dados
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

In [29]:
trab1 = pd.read_csv('titanic.csv')

In [30]:
trab1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [31]:
trab2 = trab1.drop(['PassengerId', 'Ticket', 'Cabin', 'Fare', 'Parch', 'SibSp', 'Name', 'Embarked'], axis=1)

In [32]:
trab2.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [33]:
X = trab2.iloc[:, 2:]

In [34]:
y = trab2.iloc[:, 1]

In [35]:
X.Sex = LabelEncoder().fit_transform(X.Sex)

In [36]:
X = X.fillna(X.Age.mean())

In [37]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [38]:
classifier = DecisionTreeClassifier()

In [39]:
classifier.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [40]:
predictions = classifier.predict(X_test)

In [41]:
print(predictions)

[3 1 1 3 3 3 3 3 3 3 1 3 3 3 3 2 1 3 3 2 3 3 3 3 3 3 3 3 1 1 1 3 3 3 1 3 3
 3 3 2 1 3 3 1 3 1 1 3 3 2 3 3 3 3 3 3 1 3 3 1 2 3 3 1 3 1 3 3 3 3 1 2 3 2
 3 3 3 3 3 2 3 1 1 3 1 3 2 3 3 3 1 3 3 3 3 3 3 3 2 2 3 3 1 3 3 3 3 3 3 3 1
 3 2 2 1 2 3 3 2 2 3 3 2 3 2 1 1 3 3 3 1 3 3 2 1 2 3 1 3 3 3 1 3 3 3 3 3 3
 2 1 3 1 3 1 1 3 3 1 3 3 3 3 2 1 2 3 1 3 3 3 3 2 1 1 3 1 2 3 2]

In [42]:
trab2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 28.0+ KB

In [43]:
trab2.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
dtype: int64

In [44]:
trab2.max()

Survived       1
Pclass         3
Sex         male
Age           80
dtype: object